config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-12 Mon 01:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Literate Emacs Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="The Poet Logician" />


</head>
<body>
<div id="content">
<h1 class="title">My Literate Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0ac13ab">Startup</a></li>
<li><a href="#org6feb92c">General Configuration</a></li>
<li><a href="#org6d0f272">Org-Mode Configuration</a></li>
<li><a href="#org4897a1b">Eshell Configuration</a></li>
<li><a href="#orge9fd0a4">MISC</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0ac13ab" class="outline-2">
<h2 id="org0ac13ab">Startup</h2>
<div class="outline-text-2" id="text-org0ac13ab">
<p>
I have no idea what this does, but witchmacs uses it to speed bootup.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">setq</span> gc-cons-threshold 402653184
      gc-cons-percentage 0.6)
      (add-hook 'emacs-startup-hook
          (<span style="color: #c1caa1;">lambda</span> ()
            (message <span style="color: #dddddd;">"*** Emacs loaded in %s with %d garbage collections."</span>
                     (format <span style="color: #dddddd;">"%.2f seconds"</span>
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))
</pre>
</div>
<p>
Same as above
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">defvar</span> <span style="color: #ffa575;">startup/file-name-handler-alist</span> file-name-handler-alist)
(<span style="color: #c1caa1;">setq</span> file-name-handler-alist nil)

(<span style="color: #c1caa1;">defun</span> <span style="color: #80bd9e;">startup/revert-file-name-handler-alist</span> ()
  (<span style="color: #c1caa1;">setq</span> file-name-handler-alist startup/file-name-handler-alist))

(<span style="color: #c1caa1;">defun</span> <span style="color: #80bd9e;">startup/reset-gc</span> ()
  (<span style="color: #c1caa1;">setq</span> gc-cons-threshold 16777216
    gc-cons-percentage 0.1))

(add-hook 'emacs-startup-hook 'startup/revert-file-name-handler-alist)
(add-hook 'emacs-startup-hook 'startup/reset-gc)
</pre>
</div>
<p>
This setups the melpa, enables async, and autoupdates packages
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">require</span> '<span style="color: #90afc5;">package</span>)
(<span style="color: #c1caa1;">setq</span> package-enable-at-startup nil)
(add-to-list 'package-archives
         '(<span style="color: #dddddd;">"melpa"</span> . <span style="color: #dddddd;">"https://melpa.org/packages/"</span>))
(package-initialize)

(<span style="color: #c1caa1;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(<span style="color: #c1caa1;">setq</span> use-package-always-defer t)
(<span style="color: #c1caa1;">setq</span> use-package-always-ensure t)
(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">auto-package-update</span>
  <span style="color: #b85750;">:defer</span> nil
  <span style="color: #b85750;">:ensure</span> t
  <span style="color: #b85750;">:config</span>
  (<span style="color: #c1caa1;">setq</span> auto-package-update-delete-old-versions t)
  (<span style="color: #c1caa1;">setq</span> auto-package-update-hide-results t)
  (auto-package-update-maybe))
 (<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">async</span>
    <span style="color: #b85750;">:ensure</span> t
    <span style="color: #b85750;">:init</span>
    (dired-async-mode 1))
(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">gcmh</span>
   <span style="color: #b85750;">:config</span>
   (gcmh-mode 1))
</pre>
</div>
</div>
</div>
