config.org
* General Configuration
#+BEGIN_SRC emacs-lisp
(setq make-backup-files nil)
(setq auto-save-default nil)
(setq ring-bell-function 'ignore)
(defalias 'yes-or-no-p 'y-or-n-p)
(load-theme 'poet-dark)
(when (member "Iosevka" (font-family-list))
  (set-frame-font "Iosevka" t t)
  (add-to-list 'default-frame-alist '(font . "Iosevka"))
  (set-face-attribute 'default nil :font "Iosevka")
  (set-fontset-font t 'symbol "Iosevka"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package diminish
	:ensure t)
  ;; (use-package spaceline
  ;;   :ensure t)
  ;;  (use-package powerline
  ;; 	:ensure t
  ;; 	:init
  ;; 	(spaceline-spacemacs-theme)
  ;; 	:hook
  ;; 	('after-init-hook) . 'powerline-reset)
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))


#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq-default tab-width 4)
(setq-default standard-indent 4)
(setq c-basic-offset tab-width)
(setq-default electric-indent-inhibit t)
(setq-default indent-tabs-mode t)
(setq backward-delete-char-untabify-method 'nil)

#+END_SRC

Enhancing text
#+BEGIN_SRC emacs-lisp
(global-prettify-symbols-mode t)
(setq electric-pair-pairs '(
                            (?\{ . ?\})
                            (?\( . ?\))
                            (?\[ . ?\])
                            (?\" . ?\")
                            ))
(electric-pair-mode t)
#+END_SRC

I like having several themes installed although I usually just use
the poet-dark theme.
#+BEGIN_SRC emacs-lisp
(use-package all-the-icons)
(use-package poet-theme)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun split-and-follow-horizontally ()
	(interactive)
	(split-window-below)
	(balance-windows)
	(other-window 1))
 (global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)

 (defun split-and-follow-vertically ()
	(interactive)
	(split-window-right)
	(balance-windows)
	(other-window 1))
 (global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
 

#+END_SRC

#+RESULTS:
: split-and-follow-vertically

#+BEGIN_SRC emacs-lisp
(use-package which-key
  :ensure t
  :diminish which-key-mode
  :init
  (which-key-mode))


#+END_SRC

#+RESULTS:
|   |

#+BEGIN_SRC emacs-lisp
 (use-package swiper
	:ensure t
	:bind ("C-s" . 'swiper))


#+END_SRC

#+RESULTS:
: swiper

#+BEGIN_SRC emacs-lisp
(use-package evil
  :ensure t
  :defer nil
  :init
  (setq evil-want-integration t)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-vsplit-window-right t)
  (setq evil-want-split-window-below t)
  :config
  (evil-mode 1))

#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp
(use-package evil-collection
  :after evil
  :ensure t
  :config
  (setq evil-collection-mode-list '(dashboard dired buffer))
  (evil-collection-init))

#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp
 (use-package avy
	:ensure t
	:bind
	("M-s" . avy-goto-char))

#+END_SRC

#+RESULTS:
: avy-goto-char

#+BEGIN_SRC emacs-lisp
 (use-package switch-window
	:ensure t
	:config
	(setq switch-window-input-style 'minibuffer)
	(setq switch-window-increase 4)
	(setq switch-window-threshold 2)
	(setq switch-window-shortcut-style 'qwerty)
	(setq switch-window-qwerty-shortcuts
		  '("a" "s" "d" "f" "j" "k" "l"))
	:bind
	([remap other-window] . switch-window))

#+END_SRC

#+RESULTS:
: switch-window

#+BEGIN_SRC emacs-lisp
(use-package ido
  :init
  (ido-mode 1)
  :config
  (setq ido-enable-flex-matching nil)
  (setq ido-create-new-buffer 'always)
  (setq ido-everywhere t))

#+END_SRC

#+RESULTS:
: t

General is a great package for creating keybindings with a leader key
#+BEGIN_SRC emacs-lisp
(use-package general
:config
(general-evil-setup t))
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp
(require 'general)
#+END_SRC

Buffers and Bookmarks
#+BEGIN_SRC emacs-lisp
(nvmap :states '(normal visual) :keymaps 'override :prefix "SPC"
"b b" '(ibuffer :which-key "Ibuffer")
"b c" '(clone-indirect-buffer-other-window :which-key "Clone indirect buffer other window")
"b k" '(kill-current-buffer :which-key "Kill Current Buffer")
"b n" '(next-buffer :which-key "Next buffer")
"b p" '(previous-buffer :which-key "Previous buffer")
"b B" '(ibuffer-list-buffers :which-key "Ibuffer list buffers")
"b K" '(kill-buffer :which-key "Kill buffer"))
#+END_SRC
Evaluating emacs-lisp
#+BEGIN_SRC emacs-lisp
(general-nvmap :states '(normal visual) :keymaps 'override :prefix "SPC"
"x f" '(eval-buffer :which-key "Eval emacs-lisp in buffer")
"x d" '(evale-deun :which-key "Eval defun")
"x e"   '(eval-expression :which-key "Eval emacs-lisp expression")
"x l"   '(eval-last-sexp :which-key "Eval last sexression")
"x r"   '(eval-region :which-key "Eval region"))
#+END_SRC
Files and File Management
#+BEGIN_SRC emacs-lisp
(use-package all-the-icons-dired)
(use-package dired-open)
(use-package peep-dired)

(general-nvmap :states '(normal visual) :keymaps 'override :prefix "SPC"
"f d" '(dired :which-key "Open dired")
"f j" '(dired :which-key "Dired jump to current")
"f p" '(dired :which-key "Peed-dired")) 

(general-nvmap :states '(normal visual) :keymaps 'override :prefix "SPC"
       "."     '(find-file :which-key "Find file")
       "f f"   '(find-file :which-key "Find file")
       "f r"   '(counsel-recentf :which-key "Recent files")
       "f s"   '(save-buffer :which-key "Save file")
       "f u"   '(sudo-edit-find-file :which-key "Sudo find file")
       "f y"   '(dt/show-and-copy-buffer-path :which-key "Yank file path")
       "f C"   '(copy-file :which-key "Copy file")
       "f D"   '(delete-file :which-key "Delete file")
       "f R"   '(rename-file :which-key "Rename file")
       "f S"   '(write-file :which-key "Save file as...")
       "f U"   '(sudo-edit :which-key "Sudo edit file"))

(with-eval-after-load 'dired
  ;;(define-key dired-mode-map (kbd "M-p") 'peep-dired)
  (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
  (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
  (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
  (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file))

(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
;; Get file icons in dired
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;; With dired-open plugin, you can launch external programs for certain extensions
;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
(setq dired-open-extensions '(("gif" . "sxiv")
                              ("jpg" . "sxiv")
                              ("png" . "sxiv")
                              ("mkv" . "mpv")
                              ("mp4" . "mpv")))
#+END_SRC
#+BEGIN_SRC emacs-lisp
(use-package ido-vertical-mode
  :ensure t
  :init
  (ido-vertical-mode 1))
; This enables arrow keys to select while in ido mode. If you want to
; instead use the default Emacs keybindings, change it to
; "'C-n-and-C-p-only"
(setq ido-vertical-define-keys 'C-n-C-p-up-and-down)
#+END_SRC
