config.html
<div id="outline-container-org6feb92c" class="outline-2">
<h2 id="org6feb92c">General Configuration</h2>
<div class="outline-text-2" id="text-org6feb92c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">setq</span> make-backup-files nil)
(<span style="color: #c1caa1;">setq</span> auto-save-default nil)
(<span style="color: #c1caa1;">setq</span> ring-bell-function 'ignore)
(<span style="color: #c1caa1;">defalias</span> '<span style="color: #80bd9e;">yes-or-no-p</span> 'y-or-n-p)
(load-theme 'poet-dark)
(<span style="color: #c1caa1;">when</span> (member <span style="color: #dddddd;">"Iosevka"</span> (font-family-list))
  (set-frame-font <span style="color: #dddddd;">"Iosevka"</span> t t)
  (add-to-list 'default-frame-alist '(font . <span style="color: #dddddd;">"Iosevka"</span>))
  (set-face-attribute 'default nil <span style="color: #b85750;">:font</span> <span style="color: #dddddd;">"Iosevka"</span>)
  (set-fontset-font t 'symbol <span style="color: #dddddd;">"Iosevka"</span>))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">diminish</span>
    <span style="color: #b85750;">:ensure</span> t)
  <span style="color: #aaaaaa;">;; </span><span style="color: #aaaaaa;">(use-package spaceline</span>
  <span style="color: #aaaaaa;">;;   </span><span style="color: #aaaaaa;">:ensure t)</span>
  <span style="color: #aaaaaa;">;;  </span><span style="color: #aaaaaa;">(use-package powerline</span>
  <span style="color: #aaaaaa;">;; </span><span style="color: #aaaaaa;">   :ensure t</span>
  <span style="color: #aaaaaa;">;; </span><span style="color: #aaaaaa;">   :init</span>
  <span style="color: #aaaaaa;">;; </span><span style="color: #aaaaaa;">   (spaceline-spacemacs-theme)</span>
  <span style="color: #aaaaaa;">;; </span><span style="color: #aaaaaa;">   :hook</span>
  <span style="color: #aaaaaa;">;; </span><span style="color: #aaaaaa;">   ('after-init-hook) . 'powerline-reset)</span>
(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">doom-modeline</span>
  <span style="color: #b85750;">:ensure</span> t
  <span style="color: #b85750;">:init</span> (doom-modeline-mode 1))


</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">setq-default</span> tab-width 4)
(<span style="color: #c1caa1;">setq-default</span> standard-indent 4)
(<span style="color: #c1caa1;">setq</span> c-basic-offset tab-width)
(<span style="color: #c1caa1;">setq-default</span> electric-indent-inhibit t)
(<span style="color: #c1caa1;">setq-default</span> indent-tabs-mode t)
(<span style="color: #c1caa1;">setq</span> backward-delete-char-untabify-method 'nil)

</pre>
</div>

<p>
Enhancing text
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-prettify-symbols-mode t)
(<span style="color: #c1caa1;">setq</span> electric-pair-pairs '(
                            (?\{ . ?\})
                            (?\( . ?\))
                            (?\[ . ?\])
                            (?\" . ?\")
                            ))
(electric-pair-mode t)
</pre>
</div>

<p>
I like having several themes installed although I usually just use
the poet-dark theme.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">all-the-icons</span>)
(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">poet-theme</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">defun</span> <span style="color: #80bd9e;">split-and-follow-horizontally</span> ()
    (<span style="color: #c1caa1;">interactive</span>)
    (split-window-below)
    (balance-windows)
    (other-window 1))
 (global-set-key (kbd <span style="color: #dddddd;">"C-x 2"</span>) 'split-and-follow-horizontally)

 (<span style="color: #c1caa1;">defun</span> <span style="color: #80bd9e;">split-and-follow-vertically</span> ()
    (<span style="color: #c1caa1;">interactive</span>)
    (split-window-right)
    (balance-windows)
    (other-window 1))
 (global-set-key (kbd <span style="color: #dddddd;">"C-x 3"</span>) 'split-and-follow-vertically)


</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">which-key</span>
  <span style="color: #b85750;">:ensure</span> t
  <span style="color: #b85750;">:diminish</span> which-key-mode
  <span style="color: #b85750;">:init</span>
  (which-key-mode))


</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">swiper</span>
   <span style="color: #b85750;">:ensure</span> t
   <span style="color: #b85750;">:bind</span> (<span style="color: #dddddd;">"C-s"</span> . 'swiper))


</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">evil</span>
  <span style="color: #b85750;">:ensure</span> t
  <span style="color: #b85750;">:defer</span> nil
  <span style="color: #b85750;">:init</span>
  (<span style="color: #c1caa1;">setq</span> evil-want-integration t)
  (<span style="color: #c1caa1;">setq</span> evil-want-C-u-scroll t)
  (<span style="color: #c1caa1;">setq</span> evil-want-vsplit-window-right t)
  (<span style="color: #c1caa1;">setq</span> evil-want-split-window-below t)
  <span style="color: #b85750;">:config</span>
  (evil-mode 1))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">evil-collection</span>
  <span style="color: #b85750;">:after</span> evil
  <span style="color: #b85750;">:ensure</span> t
  <span style="color: #b85750;">:config</span>
  (<span style="color: #c1caa1;">setq</span> evil-collection-mode-list '(dashboard dired buffer))
  (evil-collection-init))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">avy</span>
   <span style="color: #b85750;">:ensure</span> t
   <span style="color: #b85750;">:bind</span>
   (<span style="color: #dddddd;">"M-s"</span> . avy-goto-char))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">switch-window</span>
   <span style="color: #b85750;">:ensure</span> t
   <span style="color: #b85750;">:config</span>
   (<span style="color: #c1caa1;">setq</span> switch-window-input-style 'minibuffer)
   (<span style="color: #c1caa1;">setq</span> switch-window-increase 4)
   (<span style="color: #c1caa1;">setq</span> switch-window-threshold 2)
   (<span style="color: #c1caa1;">setq</span> switch-window-shortcut-style 'qwerty)
   (<span style="color: #c1caa1;">setq</span> switch-window-qwerty-shortcuts
         '(<span style="color: #dddddd;">"a"</span> <span style="color: #dddddd;">"s"</span> <span style="color: #dddddd;">"d"</span> <span style="color: #dddddd;">"f"</span> <span style="color: #dddddd;">"j"</span> <span style="color: #dddddd;">"k"</span> <span style="color: #dddddd;">"l"</span>))
   <span style="color: #b85750;">:bind</span>
   ([remap other-window] . switch-window))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">ido</span>
  <span style="color: #b85750;">:init</span>
  (ido-mode 1)
  <span style="color: #b85750;">:config</span>
  (<span style="color: #c1caa1;">setq</span> ido-enable-flex-matching nil)
  (<span style="color: #c1caa1;">setq</span> ido-create-new-buffer 'always)
  (<span style="color: #c1caa1;">setq</span> ido-everywhere t))

</pre>
</div>

<p>
General is a great package for creating keybindings with a leader key
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">general</span>
<span style="color: #b85750;">:config</span>
(general-evil-setup t))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">require</span> '<span style="color: #90afc5;">general</span>)
</pre>
</div>

<p>
Buffers and Bookmarks
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">nvmap</span> <span style="color: #b85750;">:states</span> '(normal visual) <span style="color: #b85750;">:keymaps</span> 'override <span style="color: #b85750;">:prefix</span> <span style="color: #dddddd;">"SPC"</span>
<span style="color: #dddddd;">"b b"</span> '(ibuffer <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Ibuffer"</span>)
<span style="color: #dddddd;">"b c"</span> '(clone-indirect-buffer-other-window <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Clone indirect buffer other window"</span>)
<span style="color: #dddddd;">"b k"</span> '(kill-current-buffer <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Kill Current Buffer"</span>)
<span style="color: #dddddd;">"b n"</span> '(next-buffer <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Next buffer"</span>)
<span style="color: #dddddd;">"b p"</span> '(previous-buffer <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Previous buffer"</span>)
<span style="color: #dddddd;">"b B"</span> '(ibuffer-list-buffers <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Ibuffer list buffers"</span>)
<span style="color: #dddddd;">"b K"</span> '(kill-buffer <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Kill buffer"</span>))
</pre>
</div>
<p>
Evaluating emacs-lisp
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">general-nvmap</span> <span style="color: #b85750;">:states</span> '(normal visual) <span style="color: #b85750;">:keymaps</span> 'override <span style="color: #b85750;">:prefix</span> <span style="color: #dddddd;">"SPC"</span>
<span style="color: #dddddd;">"x f"</span> '(eval-buffer <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Eval emacs-lisp in buffer"</span>)
<span style="color: #dddddd;">"x d"</span> '(evale-deun <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Eval defun"</span>)
<span style="color: #dddddd;">"x e"</span>   '(eval-expression <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Eval emacs-lisp expression"</span>)
<span style="color: #dddddd;">"x l"</span>   '(eval-last-sexp <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Eval last sexression"</span>)
<span style="color: #dddddd;">"x r"</span>   '(eval-region <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Eval region"</span>))
</pre>
</div>
<p>
Files and File Management
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">all-the-icons-dired</span>)
(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">dired-open</span>)
(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">peep-dired</span>)

(<span style="color: #c1caa1;">general-nvmap</span> <span style="color: #b85750;">:states</span> '(normal visual) <span style="color: #b85750;">:keymaps</span> 'override <span style="color: #b85750;">:prefix</span> <span style="color: #dddddd;">"SPC"</span>
<span style="color: #dddddd;">"f d"</span> '(dired <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Open dired"</span>)
<span style="color: #dddddd;">"f j"</span> '(dired <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Dired jump to current"</span>)
<span style="color: #dddddd;">"f p"</span> '(dired <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Peed-dired"</span>)) 

(<span style="color: #c1caa1;">general-nvmap</span> <span style="color: #b85750;">:states</span> '(normal visual) <span style="color: #b85750;">:keymaps</span> 'override <span style="color: #b85750;">:prefix</span> <span style="color: #dddddd;">"SPC"</span>
       <span style="color: #dddddd;">"."</span>     '(find-file <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Find file"</span>)
       <span style="color: #dddddd;">"f f"</span>   '(find-file <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Find file"</span>)
       <span style="color: #dddddd;">"f r"</span>   '(counsel-recentf <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Recent files"</span>)
       <span style="color: #dddddd;">"f s"</span>   '(save-buffer <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Save file"</span>)
       <span style="color: #dddddd;">"f u"</span>   '(sudo-edit-find-file <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Sudo find file"</span>)
       <span style="color: #dddddd;">"f y"</span>   '(dt/show-and-copy-buffer-path <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Yank file path"</span>)
       <span style="color: #dddddd;">"f C"</span>   '(copy-file <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Copy file"</span>)
       <span style="color: #dddddd;">"f D"</span>   '(delete-file <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Delete file"</span>)
       <span style="color: #dddddd;">"f R"</span>   '(rename-file <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Rename file"</span>)
       <span style="color: #dddddd;">"f S"</span>   '(write-file <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Save file as..."</span>)
       <span style="color: #dddddd;">"f U"</span>   '(sudo-edit <span style="color: #b85750;">:which-key</span> <span style="color: #dddddd;">"Sudo edit file"</span>))

(<span style="color: #c1caa1;">with-eval-after-load</span> 'dired
  <span style="color: #aaaaaa;">;;</span><span style="color: #aaaaaa;">(define-key dired-mode-map (kbd "M-p") 'peep-dired)</span>
  (<span style="color: #c1caa1;">evil-define-key</span> 'normal dired-mode-map (kbd <span style="color: #dddddd;">"h"</span>) 'dired-up-directory)
  (<span style="color: #c1caa1;">evil-define-key</span> 'normal dired-mode-map (kbd <span style="color: #dddddd;">"l"</span>) 'dired-open-file) <span style="color: #aaaaaa;">; </span><span style="color: #aaaaaa;">use dired-find-file instead if not using dired-open package</span>
  (<span style="color: #c1caa1;">evil-define-key</span> 'normal peep-dired-mode-map (kbd <span style="color: #dddddd;">"j"</span>) 'peep-dired-next-file)
  (<span style="color: #c1caa1;">evil-define-key</span> 'normal peep-dired-mode-map (kbd <span style="color: #dddddd;">"k"</span>) 'peep-dired-prev-file))

(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
<span style="color: #aaaaaa;">;; </span><span style="color: #aaaaaa;">Get file icons in dired</span>
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
<span style="color: #aaaaaa;">;; </span><span style="color: #aaaaaa;">With dired-open plugin, you can launch external programs for certain extensions</span>
<span style="color: #aaaaaa;">;; </span><span style="color: #aaaaaa;">For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'</span>
(<span style="color: #c1caa1;">setq</span> dired-open-extensions '((<span style="color: #dddddd;">"gif"</span> . <span style="color: #dddddd;">"sxiv"</span>)
                              (<span style="color: #dddddd;">"jpg"</span> . <span style="color: #dddddd;">"sxiv"</span>)
                              (<span style="color: #dddddd;">"png"</span> . <span style="color: #dddddd;">"sxiv"</span>)
                              (<span style="color: #dddddd;">"mkv"</span> . <span style="color: #dddddd;">"mpv"</span>)
                              (<span style="color: #dddddd;">"mp4"</span> . <span style="color: #dddddd;">"mpv"</span>)))
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">ido-vertical-mode</span>
  <span style="color: #b85750;">:ensure</span> t
  <span style="color: #b85750;">:init</span>
  (ido-vertical-mode 1))
<span style="color: #aaaaaa;">; </span><span style="color: #aaaaaa;">This enables arrow keys to select while in ido mode. If you want to</span>
<span style="color: #aaaaaa;">; </span><span style="color: #aaaaaa;">instead use the default Emacs keybindings, change it to</span>
<span style="color: #aaaaaa;">; </span><span style="color: #aaaaaa;">"'C-n-and-C-p-only"</span>
(<span style="color: #c1caa1;">setq</span> ido-vertical-define-keys 'C-n-C-p-up-and-down)
</pre>
</div>
</div>
</div>
