config.html
<div id="outline-container-org6d0f272" class="outline-2">
<h2 id="org6d0f272">Org-Mode Configuration</h2>
<div class="outline-text-2" id="text-org6d0f272">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">setq</span> org-src-fontify-natively t)
(<span style="color: #c1caa1;">setq</span> org-hide-emphasis-markers t)

(font-lock-add-keywords 'org-mode
                          '((<span style="color: #dddddd;">"^ *</span><span style="color: #dddddd; font-weight: bold;">\\</span><span style="color: #dddddd; font-weight: bold;">(</span><span style="color: #dddddd;">[-]</span><span style="color: #dddddd; font-weight: bold;">\\</span><span style="color: #dddddd; font-weight: bold;">)</span><span style="color: #dddddd;"> "</span>
                             (0 (<span style="color: #c1caa1;">prog1</span> () (compose-region (match-beginning 1) (match-end 1) <span style="color: #dddddd;">"&#8226;"</span>))))))
(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">org-bullets</span>
    <span style="color: #b85750;">:config</span>
    (add-hook 'org-mode-hook (<span style="color: #c1caa1;">lambda</span> () (org-bullets-mode 1))))
(add-hook 'org-mode-hook 'variable-pitch-mode)
(add-hook 'org-mode-hook 'visual-line-mode)

(custom-theme-set-faces
   'user
   '(org-block ((t (<span style="color: #b85750;">:inherit</span> fixed-pitch))))
   '(org-code ((t (<span style="color: #b85750;">:inherit</span> (shadow fixed-pitch)))))
   '(org-document-info ((t (<span style="color: #b85750;">:foreground</span> <span style="color: #dddddd;">"dark orange"</span>))))
   '(org-document-info-keyword ((t (<span style="color: #b85750;">:inherit</span> (shadow fixed-pitch)))))
   '(org-indent ((t (<span style="color: #b85750;">:inherit</span> (org-hide fixed-pitch)))))
   '(org-link ((t (<span style="color: #b85750;">:foreground</span> <span style="color: #dddddd;">"royal blue"</span> <span style="color: #b85750;">:underline</span> t))))
   '(org-meta-line ((t (<span style="color: #b85750;">:inherit</span> (font-lock-comment-face fixed-pitch)))))
   '(org-property-value ((t (<span style="color: #b85750;">:inherit</span> fixed-pitch))) t)
   '(org-special-keyword ((t (<span style="color: #b85750;">:inherit</span> (font-lock-comment-face fixed-pitch)))))
   '(org-table ((t (<span style="color: #b85750;">:inherit</span> fixed-pitch <span style="color: #b85750;">:foreground</span> <span style="color: #dddddd;">"#83a598"</span>))))
   '(org-tag ((t (<span style="color: #b85750;">:inherit</span> (shadow fixed-pitch) <span style="color: #b85750;">:weight</span> bold <span style="color: #b85750;">:height</span> 0.8))))
   '(org-verbatim ((t (<span style="color: #b85750;">:inherit</span> (shadow fixed-pitch))))))

(<span style="color: #c1caa1;">defface</span> <span style="color: #ffa575;">org-block-begin-line</span>
  '((t (<span style="color: #b85750;">:underline</span> <span style="color: #dddddd;">"#A7A6AA"</span> <span style="color: #b85750;">:foreground</span> <span style="color: #dddddd;">"#008ED1"</span> <span style="color: #b85750;">:background</span> <span style="color: #dddddd;">"#EAEAFF"</span>)))
  <span style="color: #dddddd;">"Face used for the line delimiting the begin of source blocks."</span>)

(<span style="color: #c1caa1;">defface</span> <span style="color: #ffa575;">org-block-background</span>
  '((t (<span style="color: #b85750;">:background</span> <span style="color: #dddddd;">"#FFFFEA"</span>)))
  <span style="color: #dddddd;">"Face used for the source block background."</span>)

(<span style="color: #c1caa1;">defface</span> <span style="color: #ffa575;">org-block-end-line</span>
  '((t (<span style="color: #b85750;">:overline</span> <span style="color: #dddddd;">"#A7A6AA"</span> <span style="color: #b85750;">:foreground</span> <span style="color: #dddddd;">"#008ED1"</span> <span style="color: #b85750;">:background</span> <span style="color: #dddddd;">"#EAEAFF"</span>)))
  <span style="color: #dddddd;">"Face used for the line delimiting the end of source blocks."</span>)

(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">org</span>
  <span style="color: #b85750;">:config</span>
  (add-hook 'org-mode-hook
            '(lambda ()
               (visual-line-mode 1))))

(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">htmlize</span>
  <span style="color: #b85750;">:ensure</span> t)

</pre>
</div>
</div>
</div>
<div id="outline-container-org4897a1b" class="outline-2">
<h2 id="org4897a1b">Eshell Configuration</h2>
<div class="outline-text-2" id="text-org4897a1b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">setq</span> eshell-prompt-regexp <span style="color: #dddddd;">"^[</span><span style="color: #dddddd;">^</span><span style="color: #dddddd;">&#206;&#177;&#206;&#187;\n]*[&#206;&#177;&#206;&#187;] "</span>)
(<span style="color: #c1caa1;">setq</span> eshell-prompt-function
      (<span style="color: #c1caa1;">lambda</span> nil
        (concat
         (<span style="color: #c1caa1;">if</span> (string= (eshell/pwd) (getenv <span style="color: #dddddd;">"HOME"</span>))
             (propertize <span style="color: #dddddd;">"~"</span> 'face `(<span style="color: #b85750;">:foreground</span> <span style="color: #dddddd;">"#99CCFF"</span>))
           (replace-regexp-in-string
            (getenv <span style="color: #dddddd;">"HOME"</span>)
            (propertize <span style="color: #dddddd;">"~"</span> 'face `(<span style="color: #b85750;">:foreground</span> <span style="color: #dddddd;">"#99CCFF"</span>))
            (propertize (eshell/pwd) 'face `(<span style="color: #b85750;">:foreground</span> <span style="color: #dddddd;">"#99CCFF"</span>))))
         (<span style="color: #c1caa1;">if</span> (= (user-uid) 0)
             (propertize <span style="color: #dddddd;">" &#206;&#177; "</span> 'face `(<span style="color: #b85750;">:foreground</span> <span style="color: #dddddd;">"#FF6666"</span>))
         (propertize <span style="color: #dddddd;">" &#206;&#187; "</span> 'face `(<span style="color: #b85750;">:foreground</span> <span style="color: #dddddd;">"#A6E22E"</span>))))))

(<span style="color: #c1caa1;">setq</span> eshell-highlight-prompt nil)

(<span style="color: #c1caa1;">defalias</span> '<span style="color: #80bd9e;">open</span> 'find-file-other-window)
(<span style="color: #c1caa1;">defalias</span> '<span style="color: #80bd9e;">clean</span> 'eshell/clear-scrollback)

(<span style="color: #c1caa1;">defun</span> <span style="color: #80bd9e;">eshell/sudo-open</span> (filename)
  <span style="color: #dddddd;">"Open a file as root in Eshell."</span>
  (<span style="color: #c1caa1;">let</span> ((qual-filename (<span style="color: #c1caa1;">if</span> (string-match <span style="color: #dddddd;">"^/"</span> filename)
                           filename
                         (concat (expand-file-name (eshell/pwd)) <span style="color: #dddddd;">"/"</span> filename))))
    (switch-to-buffer
     (find-file-noselect
      (concat <span style="color: #dddddd;">"/sudo::"</span> qual-filename)))))

(<span style="color: #c1caa1;">defun</span> <span style="color: #80bd9e;">eshell-other-window</span> ()
  <span style="color: #dddddd;">"Create or visit an eshell buffer."</span>
  (<span style="color: #c1caa1;">interactive</span>)
  (<span style="color: #c1caa1;">if</span> (not (get-buffer <span style="color: #dddddd;">"*eshell*"</span>))
      (<span style="color: #c1caa1;">progn</span>
        (split-window-sensibly (selected-window))
        (other-window 1)
        (eshell))
    (switch-to-buffer-other-window <span style="color: #dddddd;">"*eshell*"</span>)))

(global-set-key (kbd <span style="color: #dddddd;">"&lt;s-C-return&gt;"</span>) 'eshell-other-window)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge9fd0a4" class="outline-2">
<h2 id="orge9fd0a4">MISC</h2>
<div class="outline-text-2" id="text-orge9fd0a4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">magit</span>
  <span style="color: #b85750;">:ensure</span> t)


(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">yasnippet</span>
  <span style="color: #b85750;">:ensure</span> t
  <span style="color: #b85750;">:diminish</span> yas-minor-mode
  <span style="color: #b85750;">:hook</span>
  ((c-mode c++-mode) . yas-minor-mode)
  <span style="color: #b85750;">:config</span>
  (yas-reload-all))

(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">yasnippet-snippets</span>
  <span style="color: #b85750;">:ensure</span> t)

(<span style="color: #c1caa1;">use-package</span> <span style="color: #90afc5;">meghanada</span>
  <span style="color: #b85750;">:ensure</span> t
  <span style="color: #b85750;">:defer</span> nil
  <span style="color: #b85750;">:config</span>
  (add-hook 'java-mode-hook
            (<span style="color: #c1caa1;">lambda</span> ()
              (meghanada-mode t)))
  (<span style="color: #c1caa1;">setq</span> meghanada-java-path <span style="color: #dddddd;">"java"</span>)
  (<span style="color: #c1caa1;">setq</span> meghanada-maven-path <span style="color: #dddddd;">"mvn"</span>))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: The Poet Logician</p>
<p class="date">Created: 2021-07-12 Mon 01:22</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
